[
  {
    "id": "akademik",
    "title": "Akademik & Literasi",
    "description": "Program pendampingan belajar, literasi, dan pengayaan pengetahuan untuk mendukung prestasi akademik Pradnyasiwi.",
    "icon": "BookOpen",
    "image": "/images/programs/prg01x9a.jpg",
    "tujuan": "Meningkatkan prestasi akademik dan budaya belajar melalui bimbingan, literasi, serta pemanfaatan media digital.",
    "sasaran": [
      "Meningkatkan rata-rata nilai ulangan dan ujian siswa minimal 10% per tahun",
      "Membiasakan siswa mengikuti kegiatan literasi minimal satu kali setiap minggu",
      "Menyediakan akses informasi akademik dan lomba untuk seluruh warga sekolah"
    ],
    "kegiatan": [
      {
        "nama": "Pradnyasiwi Update & Booster",
        "deskripsi": "Channel informasi akademik, tips belajar, dan motivasi mingguan untuk seluruh warga SMPN 4 Pakem.",
        "jadwal": "Rutin, setiap minggu melalui kanal daring"
      },
      {
        "nama": "PIKA & FYK",
        "deskripsi": "Konten pengetahuan umum dan akademik yang dibagikan berkala dalam bentuk infografis dan pesan singkat.",
        "jadwal": "Setiap 2–4 minggu"
      },
      {
        "nama": "Rangkuman Satu Angkatan",
        "deskripsi": "Penyusunan dokumen rangkuman materi untuk persiapan ASTS/ASAS yang dikerjakan kolaboratif per angkatan.",
        "jadwal": "Menjelang SAS dan SAT setiap semester"
      }
    ],
    "pencapaian": [
      "Terbentuknya kanal informasi akademik yang terpusat untuk siswa, guru, dan orang tua  [oai_citation:0‡LEMBAR%20PENANGGUNG%20JAWAB%20OSIS%202025-2026.pdf.pdf](sediment://file_00000000f1647209bbc4620ec2fd232c)",
      "Peningkatan partisipasi siswa dalam kegiatan literasi dan berbagi rangkuman belajar",
      "Lebih dari 70% siswa aktif mengakses konten akademik digital yang disediakan OSIS"
    ]
  },
  {
    "id": "prestasi",
    "title": "Prestasi & Kompetisi",
    "description": "Program pengembangan prestasi melalui kompetisi akademik, seni, dan olahraga tingkat internal hingga eksternal.",
    "icon": "Trophy",
    "image": "/images/programs/prg02t7k.jpg",
    "tujuan": "Menciptakan budaya berprestasi yang sehat dan kompetitif serta memperluas pengalaman lomba siswa.",
    "sasaran": [
      "Meningkatkan jumlah partisipasi lomba akademik, seni, dan olahraga setiap tahun",
      "Mengirimkan perwakilan sekolah pada ajang lomba tingkat kabupaten hingga nasional",
      "Menyediakan wadah kompetisi internal sebagai seleksi dan latihan"
    ],
    "kegiatan": [
      {
        "nama": "Event Kompetisi Tingkat SMP",
        "deskripsi": "Penyelenggaraan lomba akademik, seni, dan olahraga untuk siswa SMP/MTs sederajat.",
        "jadwal": "Sekali dalam setahun pada semester genap"
      },
      {
        "nama": "Prastantion",
        "deskripsi": "Kompetisi akademik untuk siswa SD kelas 6 sebagai try out ASPD dan pengenalan SMPN 4 Pakem.",
        "jadwal": "Menjelang ujian akhir SD"
      },
      {
        "nama": "Monthly Quiz",
        "deskripsi": "Kuis bulanan berbasis daring dengan soal lintas bidang untuk melatih daya pikir dan keberanian.",
        "jadwal": "Setiap bulan"
      }
    ],
    "pencapaian": [
      "Terselenggaranya beberapa ajang kompetisi internal dan eksternal yang dikelola OSIS  [oai_citation:1‡LEMBAR%20PENANGGUNG%20JAWAB%20OSIS%202025-2026.pdf.pdf](sediment://file_00000000f1647209bbc4620ec2fd232c)",
      "Peningkatan minat siswa mengikuti lomba akademik dan non-akademik",
      "Teridentifikasinya bibit-bibit siswa berprestasi untuk dibina lebih lanjut"
    ]
  },
  {
    "id": "seni-budaya",
    "title": "Seni, Sastra, & Budaya",
    "description": "Program pengembangan potensi seni, sastra, dan pelestarian budaya lokal maupun nasional.",
    "icon": "Palette",
    "image": "/images/programs/prg03p4b.jpg",
    "tujuan": "Mewadahi kreativitas siswa di bidang seni dan membangun kebanggaan terhadap budaya Indonesia.",
    "sasaran": [
      "Melibatkan setiap kelas dalam minimal satu kegiatan seni atau budaya setiap tahun",
      "Melestarikan budaya dan aksara Jawa melalui konten kreatif digital",
      "Mendorong lahirnya karya sastra dan seni dari siswa untuk dipublikasikan"
    ],
    "kegiatan": [
      {
        "nama": "Nusantara One Day (NOD)",
        "deskripsi": "Fashion show busana adat dan permainan bertema rempah-rempah untuk mengenal kekayaan Nusantara.",
        "jadwal": "Saat event besar sekolah atau PASCREW"
      },
      {
        "nama": "LAKSITA & PKJ",
        "deskripsi": "Konten berkala tentang budaya dan Pendidikan Khas Kejogjaan menggunakan aksara Jawa di media sekolah.",
        "jadwal": "Setiap Kamis Pon dan momen tertentu"
      },
      {
        "nama": "Crayon Pradnyasiwi & Literasi Kreatif",
        "deskripsi": "Lomba puisi, cerita pendek, dan pembacaan karya dalam perayaan literasi.",
        "jadwal": "Beberapa kali dalam satu tahun pelajaran"
      }
    ],
    "pencapaian": [
      "Tumbuhnya kebiasaan menggunakan aksara Jawa di media resmi sekolah  [oai_citation:2‡LEMBAR%20PENANGGUNG%20JAWAB%20OSIS%202025-2026.pdf.pdf](sediment://file_00000000f1647209bbc4620ec2fd232c)",
      "Bertambahnya karya seni dan sastra siswa yang terdokumentasi dan dipamerkan",
      "Meningkatnya apresiasi terhadap budaya lokal dan nasional di kalangan siswa"
    ]
  },
  {
    "id": "organisasi",
    "title": "Kepemimpinan & Organisasi",
    "description": "Program pembinaan kepemimpinan, manajemen organisasi, dan penguatan solidaritas pengurus OSIS.",
    "icon": "Users",
    "image": "/images/programs/prg04u2m.jpg",
    "tujuan": "Membentuk pengurus OSIS yang komunikatif, akuntabel, dan mampu memimpin program secara mandiri.",
    "sasaran": [
      "Menyediakan forum rutin evaluasi dan perencanaan program kerja OSIS",
      "Menciptakan budaya refleksi dan saling memberi umpan balik antarpengurus",
      "Meningkatkan kerapian administrasi, data, dan keuangan OSIS"
    ],
    "kegiatan": [
      {
        "nama": "Rapat Rutin & Confiding Session",
        "deskripsi": "Rapat bulanan yang disertai sesi curhat dan evaluasi terbuka untuk memperkuat solidaritas pengurus.",
        "jadwal": "Setiap bulan selama masa jabatan OSIS  [oai_citation:3‡LEMBAR%20PENANGGUNG%20JAWAB%20OSIS%202025-2026.pdf.pdf](sediment://file_00000000f1647209bbc4620ec2fd232c)"
      },
      {
        "nama": "Lembar Penanggung Jawab & Evaluasi Kinerja",
        "deskripsi": "Pendokumentasian teknis, tujuan, dan hasil program kerja dalam LPJ serta evaluasi berkala tiap semester.",
        "jadwal": "Berjalan sepanjang periode kepengurusan"
      },
      {
        "nama": "Share, Care, Inspire & Sesi Keakraban",
        "deskripsi": "Pertukaran praktik baik dengan OSIS sekolah lain dan kegiatan keakraban internal pengurus.",
        "jadwal": "Sesuai undangan kunjungan dan jadwal internal OSIS"
      }
    ],
    "pencapaian": [
      "Seluruh program kerja terdokumentasi rapi dalam LPJ digital dan timeline OSIS",
      "Terbentuknya budaya diskusi terbuka dan refleksi kinerja di kalangan pengurus",
      "Peningkatan kualitas koordinasi lintas seksi bidang dalam setiap event besar"
    ]
  },
  {
    "id": "media-informasi",
    "title": "Media, Informasi, & Publikasi",
    "description": "Program pengelolaan informasi, dokumentasi, dan publikasi kegiatan OSIS melalui berbagai media.",
    "icon": "Newspaper",
    "image": "/images/programs/prg05n5z.jpg",
    "tujuan": "Mewujudkan OSIS yang transparan, informatif, dan dekat dengan warga sekolah melalui media tulis dan digital.",
    "sasaran": [
      "Menerbitkan buletin atau recap kinerja OSIS secara berkala",
      "Mendokumentasikan setiap event OSIS dalam bentuk foto, video, dan laporan",
      "Mengoptimalkan media sosial dan kanal daring sebagai sarana komunikasi resmi"
    ],
    "kegiatan": [
      {
        "nama": "OSIS News & OSIS Recap",
        "deskripsi": "Buletin berkala dan rangkuman visual kinerja OSIS selama satu periode kepengurusan.",
        "jadwal": "OSIS News tiap 6 bulan, OSIS Recap di akhir masa jabatan  [oai_citation:4‡LEMBAR%20PENANGGUNG%20JAWAB%20OSIS%202025-2026.pdf.pdf](sediment://file_00000000f1647209bbc4620ec2fd232c)"
      },
      {
        "nama": "Dokumentasi & Konten Digital",
        "deskripsi": "Peliputan foto/video setiap kegiatan serta pembuatan poster, WOTW, FYK, dan konten edukatif lain.",
        "jadwal": "Setiap event dan tiap pekan untuk konten rutin"
      },
      {
        "nama": "Web Profil OSIS",
        "deskripsi": "Penyusunan situs profil berisi visi, misi, anggota, dan ringkasan kegiatan OSIS 25/26.",
        "jadwal": "Diselesaikan dalam tahun pertama kepengurusan"
      }
    ],
    "pencapaian": [
      "OSIS memiliki arsip digital kegiatan yang lengkap dan mudah diakses",
      "Peningkatan interaksi siswa dengan konten OSIS di media sosial sekolah",
      "Terbentuknya citra OSIS yang terbuka dan akuntabel di mata warga sekolah"
    ]
  },
  {
    "id": "kesehatan-lingkungan",
    "title": "Kesehatan, Wellbeing, & Lingkungan",
    "description": "Program yang mendukung kesehatan fisik, mental, dan kelestarian lingkungan sekolah.",
    "icon": "Heart",
    "image": "/images/programs/prg06h8c.jpg",
    "tujuan": "Menumbuhkan gaya hidup sehat dan kepedulian lingkungan melalui kegiatan rutin dan event tematik.",
    "sasaran": [
      "Meningkatkan kesadaran gizi dan kesehatan di kalangan siswa",
      "Mengurangi sampah dan meningkatkan penghijauan di lingkungan sekolah",
      "Menyediakan aktivitas yang membantu meredakan stres belajar"
    ],
    "kegiatan": [
      {
        "nama": "Juice with Pradnyasiwi (JWP)",
        "deskripsi": "Pembagian minuman sehat saat PASCREW sebagai edukasi gizi bagi siswa.",
        "jadwal": "Saat PASCREW setiap akhir semester  [oai_citation:5‡LEMBAR%20PENANGGUNG%20JAWAB%20OSIS%202025-2026.pdf.pdf](sediment://file_00000000f1647209bbc4620ec2fd232c)"
      },
      {
        "nama": "Pradnyasiwi Go Green & B.E.R.S.I.H",
        "deskripsi": "Penanaman tanaman oleh tiap kelas serta lomba poster/video bertema lingkungan.",
        "jadwal": "Sepanjang tahun, disesuaikan dengan hari besar lingkungan"
      },
      {
        "nama": "Inspirasi Pradnyasiwi",
        "deskripsi": "Event pasca-ujian berisi kegiatan penghijauan, lomba kebersihan, dan sosialisasi lingkungan untuk melepas stres.",
        "jadwal": "Setelah SAS dan SAT"
      }
    ],
    "pencapaian": [
      "Meningkatnya partisipasi siswa dalam kegiatan ramah lingkungan di sekolah",
      "Lingkungan sekolah menjadi lebih hijau dan terawat berkat keterlibatan tiap kelas",
      "Program kesehatan dan lingkungan menjadi salah satu identitas positif OSIS"
    ]
  }
]